
@JarekGie, here is the result of the Terraform plan:

```terraform
[command]/home/runner/work/_temp/29f96066-97b1-4fc1-be63-0bd0c770ebdc/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.remote_state.aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "testowy-bucket-ernesta"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # module.remote_state.aws_s3_bucket.terraform_state will be created
  + resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "537124936209-testowy-bucket-ernesta"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.remote_state.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.remote_state.aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.remote_state.aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_caller_identity_id = "537124936209"
  + bucket_arn             = (known after apply)
  + bucket_id              = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.remote_state.aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "testowy-bucket-ernesta"%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags_all         = (known after apply)%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A    }%0A%0A  # module.remote_state.aws_s3_bucket.terraform_state will be created%0A  + resource "aws_s3_bucket" "terraform_state" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "537124936209-testowy-bucket-ernesta"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.remote_state.aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.remote_state.aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.remote_state.aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + aws_caller_identity_id = "537124936209"%0A  + bucket_arn             = (known after apply)%0A  + bucket_id              = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```
